# DuplicateFieldRemovedFromKeySchedule Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..ScheduleViewFailures..::..DuplicateFieldRemovedFromKeySchedule Property
BuiltInFailures..::..ScheduleViewFailures Class See Also
---
Duplicate fields across key schedules will be removed after paste.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId DuplicateFieldRemovedFromKeySchedule { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property DuplicateFieldRemovedFromKeySchedule As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ DuplicateFieldRemovedFromKeySchedule {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..ScheduleViewFailures Class
Autodesk.Revit.DB Namespace